IntoYun/firmware/hal/src/esp32-share/wlan_hal.cpp
/**
 ******************************************************************************
  Copyright (c) 2013-2014 IntoRobot Team.  All right reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation, either
  version 3 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, see <http://www.gnu.org/licenses/>.
  ******************************************************************************
*/

#include "wlan_hal.h"
#include "esp_wifi_types.h"
#include "esp32_wifi_generic.h"
#include "esp_wifi.h"
#include "esp_smartconfig.h"
#include "esp_err.h"
#include "esp_intr.h"
#include "lwip/dns.h"
#include "rom/queue.h"
#include "memory_hal.h"
#include "flash_map.h"
#include "delay_hal.h"
#include "esp32-hal.h"

#define STATION_IF      0x00
#define SOFTAP_IF       0x01

static volatile uint32_t wlan_timeout_start;
static volatile uint32_t wlan_timeout_duration;

inline void WLAN_TIMEOUT(uint32_t dur) {
    wlan_timeout_start = HAL_Timer_Get_Milli_Seconds();
    wlan_timeout_duration = dur;
    //DEBUG("WLAN WD Set %d",(dur));
}
inline bool IS_WLAN_TIMEOUT() {
    return wlan_timeout_duration && ((HAL_Timer_Get_Milli_Seconds()-wlan_timeout_start)>wlan_timeout_duration);
}

inline void CLR_WLAN_TIMEOUT() {
    wlan_timeout_duration = 0;
    //DEBUG("WLAN WD Cleared, was %d", wlan_timeout_duration);
}

uint32_t HAL_NET_SetNetWatchDog(uint32_t timeOutInMS)
{
    return 0;
}

int wlan_clear_credentials()
{
    return 0;
}

int wlan_has_credentials()
{
    return 0;
}

wlan_result_t wlan_activate()
{
    return 0;
}

wlan_result_t wlan_deactivate()
{
    return 0;
}

int wlan_connect()
{
    // esp32_connect();
    return 0;
}

wlan_result_t wlan_disconnect()
{
    // esp32_disconnect();
}

int wlan_status()
{
    esp32_status();
    return -1;
}

int wlan_connected_rssi(void)
{
    // return esp32_getRSSI();
}

int wlan_set_credentials(WLanCredentials* c)
{
    #if 1
    // struct station_config conf;
    // wifi_sta_config_t  conf;
    wifi_config_t conf;
    strcpy((char*)(conf.sta.ssid), c->ssid);

    if(c->password)
    {
        if (strlen(c->password) == 64) // it's not a passphrase, is the PSK
            memcpy((char*)(conf.sta.password), c->password, 64);
        else
            strcpy((char*)(conf.sta.password), c->password);
    }
    else
    {
        *conf.sta.password = 0;
    }
    conf.sta.bssid_set = 0;
    //disable uart interrupt
    // ETS_UART_INTR_DISABLE();
    // ESP_INTR_DISABLE(5);
    // workaround for #1997: make sure the value of ap_number is updated and written to flash
    // to be removed after SDK update
    // wifi_station_ap_number_set(2);
    // wifi_station_ap_number_set(1;

    // wifi_station_set_config(&conf);
     esp_wifi_set_config(ESP_IF_WIFI_STA,&conf);
    // ETS_UART_INTR_ENABLE();
     // ESP_INTR_ENABLE(5);
    #endif
    return 0;
}

void wlan_Imlink_start()
{
    // esp32_beginSmartConfig();
}

imlink_status_t wlan_Imlink_get_status()
{
    // if(!esp32_smartConfigDone())
        return IMLINK_DOING;
    // else
        return IMLINK_SUCCESS;
}

void wlan_Imlink_stop()
{
   // esp32_stopSmartConfig();
}

void wlan_setup()
{
    // esp32_setMode(WIFI_MODE_STA);
    // esp32_setDHCP(true);
    // esp32_setAutoConnect(true);
    // esp32_setAutoReconnect(true);
}

void wlan_fetch_ipconfig(WLanConfig* config)
{
    #if  1 
    memset(config, 0, sizeof(WLanConfig));
    config->size = sizeof(WLanConfig);

    tcpip_adapter_ip_info_t ip;
    tcpip_adapter_get_ip_info(TCPIP_ADAPTER_IF_STA, &ip);

    // struct ip_info ip;
    // wifi_get_ip_info(STATION_IF, &ip);
    config->nw.aucIP.ipv4 = ip.ip.addr;
    config->nw.aucSubnetMask.ipv4 = ip.netmask.addr;
    config->nw.aucDefaultGateway.ipv4 = ip.gw.addr;

    ip_addr_t dns_ip = dns_getserver(0);
    // config->nw.aucDNSServer.ipv4 = dns_ip.addr;
    config->nw.aucDNSServer.ipv4 = dns_ip.u_addr.ip4.addr;
    // wifi_get_macaddr(STATION_IF, config->nw.uaMacAddr);
    esp_wifi_get_mac(STATION_IF, config->nw.uaMacAddr);

    // struct station_config conf;
    wifi_config_t conf;
    // wifi_station_get_config(&conf);
    esp_wifi_set_config(ESP_IF_WIFI_STA,&conf);
    memcpy(config->uaSSID, conf.sta.ssid, 32);
    memcpy(config->BSSID, conf.sta.bssid, 6);
    #endif

}

void wlan_set_error_count(uint32_t errorCount)
{
}


/**
 * Sets the IP source - static or dynamic.
 */
void wlan_set_ipaddress_source(IPAddressSource source, bool persist, void* reserved)
{
}

/**
 * Sets the IP Addresses to use when the device is in static IP mode.
 * @param device
 * @param netmask
 * @param gateway
 * @param dns1
 * @param dns2
 * @param reserved
 */
void wlan_set_ipaddress(const HAL_IPAddress* device, const HAL_IPAddress* netmask,
        const HAL_IPAddress* gateway, const HAL_IPAddress* dns1, const HAL_IPAddress* dns2, void* reserved)
{

}

WLanSecurityType toSecurityType(wifi_auth_mode_t authmode)
{
    switch(authmode)
    {
        case WIFI_AUTH_OPEN:
            return WLAN_SEC_UNSEC;
            break;
        case WIFI_AUTH_WEP:
            return WLAN_SEC_WEP;
            break;
        case WIFI_AUTH_WPA_PSK:
            return WLAN_SEC_WPA;
            break;
        case WIFI_AUTH_WPA2_PSK:
        case WIFI_AUTH_WPA_WPA2_PSK:
            return WLAN_SEC_WPA2;
            break;
        case WIFI_AUTH_MAX:
            return WLAN_SEC_NOT_SET;
            break;
    }
}

WLanSecurityCipher toCipherType(wifi_auth_mode_t authmode)
{
    switch(authmode)
    {
        case WIFI_AUTH_WEP:
            return WLAN_CIPHER_AES;
            break;
        case WIFI_AUTH_WPA_PSK:
            return WLAN_CIPHER_TKIP;
            break;
        default:
            break;
    }
    return WLAN_CIPHER_NOT_SET;
}

struct WlanScanInfo
{
    wlan_scan_result_t callback;
    void* callback_data;
    int count;
    bool completed;
};

struct WlanApSimple
{
   uint8_t bssid[6];
   int rssi;
};


WlanScanInfo scanInfo;

void scan_done_cb(void *arg, STATUS status)
{
    WiFiAccessPoint data;
    WlanApSimple apSimple;
    int n = 0, m = 0, j = 0;
    // bss_info *it = (bss_info*)arg;
    wifi_ap_record_t *it;

    if(status == OK)
    {
        //获取ap数量
        // for(n = 0; it; it = STAILQ_NEXT(it, next), n++);
        // scanInfo.count = n;
        scanInfo.count = WiFi_getScanCount();

        //申请内存
        WlanApSimple *pNode = (WlanApSimple *)malloc(sizeof(struct WlanApSimple)*scanInfo.count);
        if(pNode == NULL)
        {
            scanInfo.completed = true;
            return;
        }

        // for(n = 0, it = (bss_info*)arg; it; it = STAILQ_NEXT(it, next), n++)
        uint8_t sec_scan;
        int32_t chan_scan;

        for(n = 0; n < scanInfo.count; n++)
        {
            getNetworkInfo(n,it->ssid, sec_scan, it->rssi, it->bssid, chan_scan);
            memcpy(pNode[n].bssid, it->bssid, 6);
            pNode[n].rssi = it->rssi;
        }

        //根据rssi排序
        for(n = 0; n < scanInfo.count - 1; n++)
        {
            j = n;
            for(m = n+1; m < scanInfo.count; m++)
            {
                if(pNode[m].rssi > pNode[j].rssi)
                {
                    j = m;
                }
            }
            if(j != n)
            {
                memcpy(&apSimple, &pNode[n], sizeof(struct WlanApSimple));
                memcpy(&pNode[n], &pNode[j], sizeof(struct WlanApSimple));
                memcpy(&pNode[j], &apSimple, sizeof(struct WlanApSimple));
            }
        }

        //填充ap 列表
        for(n = 0; n < scanInfo.count; n++)
        {
            // for(it = (bss_info*)arg; it; it = STAILQ_NEXT(it, next))
            {
                if(!memcmp(pNode[n].bssid, it->bssid, 6))
                {
                    memset(&data, 0, sizeof(WiFiAccessPoint));
                    // memcpy(data.ssid, it->ssid, it->ssid_len);
                    memcpy(data.ssid, it->ssid, sizeof(it->ssid));//it->ssid_len);
                    // data.ssidLength = it->ssid_len;
                    memcpy(data.bssid, it->bssid, 6);
                    data.security = toSecurityType(it->authmode);
                    data.cipher = toCipherType(it->authmode);
                    // data.channel = it->pi;
                    data.rssi = it->rssi;
                    scanInfo.callback(&data, scanInfo.callback_data);
                    break;
                }
            }
        }
        scanInfo.completed = true;
        free(pNode);
    }

}

#if 0
void scan_done_cb(void *arg, STATUS status)
 // void scan_done_cb(wifi_scan_config_t arg, STATUS status)
{
    WiFiAccessPoint data;
    WlanApSimple apSimple;
    int n = 0, m = 0, j = 0;
    bss_info *it = (bss_info*)arg;

    if(status == OK)
    {
        //获取ap数量
        for(n = 0; it; it = STAILQ_NEXT(it, next), n++);
        scanInfo.count = n;

        //申请内存
        WlanApSimple *pNode = (WlanApSimple *)malloc(sizeof(struct WlanApSimple)*scanInfo.count);
        if(pNode == NULL)
        {
            scanInfo.completed = true;
            return;
        }

        for(n = 0, it = (bss_info*)arg; it; it = STAILQ_NEXT(it, next), n++)
        {
            memcpy(pNode[n].bssid, it->bssid, 6);
            pNode[n].rssi = it->rssi;
        }

        //根据rssi排序
        for(n = 0; n < scanInfo.count - 1; n++)
        {
            j = n;
            for(m = n+1; m < scanInfo.count; m++)
            {
                if(pNode[m].rssi > pNode[j].rssi)
                {
                    j = m;
                }
            }
            if(j != n)
            {
                memcpy(&apSimple, &pNode[n], sizeof(struct WlanApSimple));
                memcpy(&pNode[n], &pNode[j], sizeof(struct WlanApSimple));
                memcpy(&pNode[j], &apSimple, sizeof(struct WlanApSimple));
            }
        }

        //填充ap 列表
        for(n = 0; n < scanInfo.count; n++)
        {
            for(it = (bss_info*)arg; it; it = STAILQ_NEXT(it, next))
            {
                if(!memcmp(pNode[n].bssid, it->bssid, 6))
                {
                    memset(&data, 0, sizeof(WiFiAccessPoint));
                    memcpy(data.ssid, it->ssid, it->ssid_len);
                    data.ssidLength = it->ssid_len;
                    memcpy(data.bssid, it->bssid, 6);
                    data.security = toSecurityType(it->authmode);
                    data.cipher = toCipherType(it->authmode);
                    data.channel = it->channel;
                    data.rssi = it->rssi;
                    scanInfo.callback(&data, scanInfo.callback_data);
                    break;
                }
            }
        }
        scanInfo.completed = true;
        free(pNode);
    }
}
#endif

extern "C" {
void optimistic_yield(uint32_t interval_us);
}

int wlan_scan(wlan_scan_result_t callback, void* cookie)
{
    esp32_setMode(WIFI_STA);
    memset((void *)&scanInfo, 0, sizeof(struct WlanScanInfo));
    scanInfo.callback = callback;
    scanInfo.callback_data = cookie;
    scanInfo.count = 0;
    scanInfo.completed = false;

    wifi_scan_config_t config;
    config.ssid = 0;
    config.bssid = 0;
    config.channel = 0;
    // config.show_hidden = show_hidden;

    // if(wifi_station_scan(NULL, scan_done_cb))
    if(esp_wifi_scan_start(&config, true) == ESP_OK) 
    {
        WLAN_TIMEOUT(6000);
        while(!scanInfo.completed)
        {
                optimistic_yield(100);
                if(IS_WLAN_TIMEOUT())
                {
                    CLR_WLAN_TIMEOUT();
                    break;
                }
        }
        return scanInfo.count;
    }
    else
    {
        return -1;
    }
}

/**
 * Lists all WLAN credentials currently stored on the device
 */
int wlan_get_credentials(wlan_scan_result_t callback, void* callback_data)
{
    // Reading credentials from the CC3000 is not possible
    return 0;
}

/**
 * wifi set station and ap mac addr
 */
int wlan_set_macaddr(uint8_t *stamacaddr, uint8_t *apmacaddr)
{
    if (stamacaddr != NULL && apmacaddr != NULL){
    mac_param_t mac_addrs;
    mac_addrs.header = FLASH_MAC_HEADER;

    memset(mac_addrs.stamac_addrs, 0, sizeof(mac_addrs.stamac_addrs));
    memcpy(mac_addrs.stamac_addrs, stamacaddr, sizeof(mac_addrs.stamac_addrs));

    memset(mac_addrs.apmac_addrs, 0, sizeof(mac_addrs.apmac_addrs));
    memcpy(mac_addrs.apmac_addrs, apmacaddr, sizeof(mac_addrs.apmac_addrs));

    uint32_t len = sizeof(mac_addrs);
    HAL_FLASH_Interminal_Erase(HAL_FLASH_Interminal_Get_Sector(FLASH_MAC_START_ADDR));
    HAL_FLASH_Interminal_Write(FLASH_MAC_START_ADDR, (uint32_t *)&mac_addrs, len);
    return 0;
    }
    return -1;

}

/**
 * wifi get station and ap mac addr
 */
int wlan_get_macaddr(uint8_t *stamacaddr, uint8_t *apmacaddr)
{
    if(!esp_wifi_get_mac(WIFI_IF_STA, stamacaddr))
    {
        return -1;
    }

    if(!esp_wifi_get_mac(WIFI_IF_AP, apmacaddr))
    {
        return -1;
    }
    return 0;
}

int wlan_set_macaddr_from_flash(uint8_t *stamacaddr, uint8_t *apmacaddr)
{
     if(!esp_wifi_set_mac(STATION_IF, stamacaddr))
         {
             return -1;
         }
     if(!esp_wifi_set_mac(SOFTAP_IF, apmacaddr))
         {
             return -1;
         }
     return 0;
}

int wlan_set_macaddr_when_init(void)
{
     mac_param_t mac_addrs;
     HAL_FLASH_Interminal_Read(FLASH_MAC_START_ADDR, (uint32_t *)&mac_addrs, sizeof(mac_addrs));
     if (FLASH_MAC_HEADER == mac_addrs.header){
         esp32_setMode(WIFI_AP_STA);
         wlan_set_macaddr_from_flash(mac_addrs.stamac_addrs, mac_addrs.apmac_addrs);
         esp32_setMode(WIFI_STA);
         // for (int i = 0; i < 6; i++){
         //     DEBUG("stamac: %x", mac_addrs.stamac_addrs[i]);
         // }
         // HAL_FLASH_Interminal_Erase(HAL_FLASH_Interminal_Get_Sector(FLASH_MAC_START_ADDR));
     }
}
